Repository: waytoo-average/Focus-zone
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Focus Zone
ar: منطقة التركيز

source: Settings
ar: الإعدادات

source: Error
ar: خطأ

source: OK
ar: موافق

source: Cancel
ar: إلغاء

source: Retry
ar: إعادة المحاولة!

# notAvailableNow
source: Content not available at the moment. Please check back later!
ar: المحتوى غير متاح في الوقت الحالي. يرجى التحقق لاحقًا!

source: Unknown User
ar: مستخدم غير معروف

source: Unnamed Item
ar: عنصر بدون اسم

source: Loading localizations...
ar: جاري تحميل اللغات...

source: Sign In
ar: تسجيل الدخول

# signedInAs
source: Signed in as {userName}
ar: تم تسجيل الدخول باسم {userName}

source: Sign Out
ar: تسجيل الخروج

source: Sign In with Google
ar: تسجيل الدخول بحساب جوجل

# notSignedInClientNotAvailable
source: Not signed in or client not available. Please sign in.
ar: لم يتم تسجيل الدخول أو العميل غير متاح. يرجى تسجيل الدخول.

# maxUserLimitReached
source: Maximum user limit reached. You can still use other app features without signing in. Please wait for future updates.
ar: تم الوصول للحد الأقصى للمستخدمين. يمكنك الاستمرار في استخدام ميزات التطبيق الأخرى بدون تسجيل الدخول. يرجى الانتظار للتحديثات المستقبلية.

source: First Grade
ar: الفرقة الأولى

source: Second Grade
ar: الفرقة الثانية

source: Third Grade
ar: الفرقة الثالثة

source: Fourth Grade
ar: الفرقة الرابعة

# communication
source: Communication Department
ar: قسم الاتصالات

# electronics
source: Electronics Department
ar: قسم الإلكترونيات

# mechatronics
source: Mechatronics Department
ar: قسم الميكاترونكس

source: Current Year
ar: العام الحالي

source: Last Year
ar: العام الماضي

# semester1
source: First Semester
ar: الفصل الدراسي الأول

# semester2
source: Second Semester
ar: الفصل الدراسي الثاني

source: Lectures
ar: المحاضرات

source: Explanation
ar: الشرح

source: Summaries
ar: الملخصات

source: Lecture Content
ar: محتوى المحاضرة

# errorMissingContext
source: Missing academic context. Please navigate from the home screen.
ar: سياق أكاديمي مفقود. يرجى التنقل من الشاشة الرئيسية.

# errorMissingSubjectDetails
source: Missing subject details. Cannot display content.
ar: تفاصيل الموضوع مفقودة. لا يمكن عرض المحتوى.

# explanationContentNotAvailable
source: Explanation content for {subjectName} is not yet available.
ar: محتوى الشرح لـ {subjectName} غير متاح بعد.

# summariesContentNotAvailable
source: Summaries for {subjectName} are not yet available.
ar: الملخصات لـ {subjectName} غير متاحة بعد.

source: Error: Missing folder ID.
ar: خطأ: معرف المجلد مفقود.

# failedToLoadFiles
source: Failed to load files: {error}
ar: فشل تحميل الملفات: {error}

source: Error: No URL provided.
ar: خطأ: لم يتم توفير عنوان URL.

# failedToLoadPdf
source: Failed to load PDF: {error}
ar: فشل تحميل ملف PDF: {error}

# errorDownloadCancelled
source: Download cancelled!
ar: تم إلغاء التنزيل.

# errorFileIdMissing
source: Error: File ID is missing.
ar: خطأ: معرف الملف مفقود.

source: Downloading
ar: جار التحميل

# errorLoadingContent
source: Error loading content: {description}
ar: خطأ في تحميل المحتوى: {description}

# cannotOpenFileType
source: Cannot open this file type directly.
ar: لا يمكن فتح هذا النوع من الملفات مباشرة.

# downloadStarted
source: Starting {count,plural, =1{1 download} other{{count} downloads}}...
ar: بدء {count,plural, =1{1 تنزيل} other{{count} تنزيلات}}...

# downloadCompleted
source: Download completed: {fileName}
ar: اكتمل التنزيل: {fileName}

source: Open File
ar: فتح الملف

# downloadFailed
source: Download failed for {fileName}: {error}
ar: فشل تنزيل {fileName}: {error}

# downloadCancelled
source: Download cancelled for: {fileName}
ar: تم إلغاء التنزيل لـ: {fileName}

source: All downloads completed!
ar: اكتملت جميع التنزيلات!

source: Open Folder
ar: فتح المجلد

# couldNotOpenFolder
source: Could not open folder: {error}
ar: تعذر فتح المجلد: {error}

source: Download in progress. Please wait.
ar: التنزيل قيد التقدم. يرجى الانتظار.

source: Cancel Selection
ar: إلغاء التحديد

# itemsSelected
source: {count} Items Selected
ar: {count} عناصر محددة

# detailsAction
source: Details
ar: التفاصيل

# downloadAction
source: Download
ar: تنزيل

# noItemSelectedForDetails
source: Please select exactly one item to view details.
ar: يرجى تحديد عنصر واحد فقط لعرض التفاصيل.

source: File Details
ar: تفاصيل الملف

# fileNameField
source: File Name
ar: اسم الملف

# fileTypeField
source: File Type
ar: نوع الملف

# fileSizeField
source: File Size
ar: حجم الملف

# lastModifiedField
source: Last Modified
ar: آخر تعديل

source: About College
ar: عن الكلية

source: Choose Language
ar: اختيار اللغة

source: English
ar: الإنجليزية

source: Arabic
ar: العربية

source: Choose Theme
ar: اختيار المظهر

source: Light Theme
ar: المظهر الفاتح

source: Dark Theme
ar: المظهر الداكن

source: System Default
ar: افتراضي النظام

source: Download Location
ar: موقع التنزيل

# filesWillBeDownloadedTo
source: Files will be downloaded to: {path}
ar: سيتم تنزيل الملفات إلى: {path}

# permissionDeniedStorage
source: Storage permission denied. Cannot choose download location.
ar: تم رفض إذن التخزين. لا يمكن اختيار موقع التنزيل.

# permissionDenied
source: Permission denied. Cannot access storage.
ar: تم رفض الإذن. لا يمكن الوصول إلى التخزين.

source: No directory selected.
ar: لم يتم تحديد دليل.

# failedToCreateDirectory
source: Failed to create download directory: {error}
ar: فشل إنشاء مجلد التنزيل: {error}

# failedToChooseDownloadPath
source: Failed to choose download path: {error}
ar: فشل في اختيار مسار التنزيل: {error}

# downloadPathSetTo
source: Download path set to: {path}
ar: تم تعيين مسار التنزيل إلى: {path}

# downloadPathSetToFallback
source: Download path set to: {path} (Fallback to app-specific storage)
ar: تم تعيين مسار التنزيل إلى: {path} (العودة إلى التخزين الخاص بالتطبيق)

# selectedDownloadPath
source: You selected: {path}
ar: لقد اخترت: {path}

# downloadPathWarning
source: Warning: Due to Android restrictions, files may be downloaded to app-specific storage: {actualPath}
ar: تحذير: بسبب قيود أندرويد، قد يتم تنزيل الملفات إلى التخزين الخاص بالتطبيق: {actualPath}

# appSpecificDownloadPath
source: App-Specific
ar: خاص بالتطبيق

# clearCustomDownloadPathOption
source: Clear Custom Download Path
ar: مسح مسار التنزيل المخصص

# confirmClearCustomDownloadPath
source: Are you sure you want to clear the custom download path? Downloads will revert to app-specific storage.
ar: هل أنت متأكد من أنك تريد مسح مسار التنزيل المخصص؟ ستعود التنزيلات إلى التخزين الخاص بالتطبيق.

# customDownloadPathCleared
source: Custom download path setting removed. Downloads will now go to app-specific storage.
ar: تمت إزالة إعداد مسار التنزيل المخصص. ستذهب التنزيلات الآن إلى التخزين الخاص بالتطبيق.

# customDownloadPathClearedConfirmation
source: Custom download path cleared. Downloads will now go to app-specific storage.
ar: تم مسح مسار التنزيل المخصص. ستذهب التنزيلات الآن إلى التخزين الخاص بالتطبيق.

source: Clear PDF Cache
ar: مسح ذاكرة التخزين المؤقت لملفات PDF

source: Confirm Action
ar: تأكيد الإجراء

# confirmClearCache
source: Are you sure you want to clear all internally cached PDF files? This will free up space but require re-downloading.
ar: هل أنت متأكد أنك تريد مسح جميع ملفات PDF المخزنة مؤقتًا داخليًا؟ سيؤدي ذلك إلى تحرير مساحة ولكن يتطلب إعادة التنزيل.

# cacheClearedItems
source: Cleared {count} cached PDF files.
ar: تم مسح {count} ملف PDF مخزنة مؤقتًا.

# cacheClearFailed
source: Failed to clear PDF cache: {error}
ar: فشل مسح ذاكرة التخزين المؤقت لملفات PDF: {error}

source: About
ar: حول التطبيق

# appVersion
source: Version
ar: الإصدار

# appDescription
source: Focus Zone is a mobile application designed to help students access and organize their academic materials from Google Drive.
ar: منطقة التركيز هو تطبيق جوال مصمم لمساعدة الطلاب على الوصول إلى موادهم الأكاديمية وتنظيمها من جوجل درايف.

# madeBy
source: Developed By
ar: تم التطوير بواسطة

# developerName
source: Belal Mohamed Elnemr
ar: بلال محمد النمر

# developerDetails
source: Communication Engineering Student
ar: طالب هندسة اتصالات وإلكترونيات

source: Contact Info
ar: معلومات الاتصال

source: Phone Number
ar: رقم الهاتف

source: Email
ar: البريد الإلكتروني

# couldNotLaunchUrl
source: Could not launch URL: {url}
ar: تعذر فتح الرابط: {url}

# collegeName
source: Egyptian Chinese College of Applied Technology
ar: الكلية المصرية الصينية للتكنولوجيا التطبيقية

# eccatIntro
source: The Egyptian-Chinese College for Applied Technology at Suez Canal University is a joint initiative with China offering hands-on, industry-focused education in fields like mechatronics, electronics, and communication technology..
ar: الكلية المصرية الصينية للتكنولوجيا التطبيقية بجامعة قناة السويس هي مبادرة مشتركة مع الصين تقدم تعليماً عملياً يركز على الصناعة في مجالات مثل الميكاترونيات والإلكترونيات وتكنولوجيا الاتصالات.

source: Connect With Us
ar: تواصل معنا

source: Facebook Page
ar: صفحة الفيسبوك

source: College Location
ar: موقع الكلية

source: Refresh
ar: تحديث

# noFilesFound
source: No files found in this folder.
ar: لم يتم العثور على ملفات في هذا المجلد.

source: Clear
ar: مسح

source: Not Set
ar: غير محدد

# studyButton
source: Study
ar: دراسة

# exitButton
source: Exit App
ar: الخروج من التطبيق

# todoListButton
source: To-Do List
ar: قائمة المهام

# todoListTitle
source: My To-Do List
ar: قائمة المهام

source: Add Task
ar: إضافة مهمة

source: Enter your task here...
ar: أدخل مهمتك هنا...

# noTasksYet
source: No tasks yet! Add one below.
ar: لا توجد مهام بعد! أضف واحدة أدناه.

source: Task added!
ar: تمت إضافة المهمة!

source: Task completed!
ar: تم إكمال المهمة!

source: Task reactivated!
ar: تم إعادة تنشيط المهمة!

source: Task deleted!
ar: تم حذف المهمة!

# emptyTaskError
source: Task cannot be empty.
ar: لا يمكن أن تكون المهمة فارغة.

# allListsTitle
source: All Lists
ar: جميع القوائم

# overdueTasks
source: Overdue
ar: مهام متأخرة

# todayTasks
source: Today
ar: اليوم

# tomorrowTasks
source: Tomorrow
ar: غداً

# thisWeekTasks
source: This Week
ar: هذا الأسبوع

# enterQuickTaskHint
source: Enter Quick Task Here
ar: أدخل مهمة سريعة هنا

# searchTooltip
source: Search
ar: بحث

# newTaskTitle
source: New Task
ar: مهمة جديدة

# editTaskTitle
source: Edit Task
ar: تعديل المهمة

source: What is to be done?
ar: ما الذي يجب عمله؟

source: Due date
ar: تاريخ الاستحقاق

# dueTime
source: Time
ar: الوقت

source: Notifications
ar: الإشعارات

source: Repeat
ar: تكرار

# addToLlist
source: Add to List
ar: إضافة إلى قائمة

source: No Repeat
ar: لا تكرار

source: Daily
ar: يومي

source: Weekly
ar: أسبوعي

source: Monthly
ar: شهري

source: Personal
ar: شخصي

source: Work
ar: عمل

source: Shopping
ar: تسوق

source: Default List
ar: قائمة افتراضية

source: Save Task
ar: حفظ المهمة

source: Task saved!
ar: تم حفظ المهمة!

# searchTasksHint
source: Search tasks...
ar: البحث عن المهام.

# noMatchingTasks
source: No matching tasks found.
ar: لم يتم العثور على مهام مطابقة.

# laterTasks
source: Later
ar: لاحقاً

# noDateTasks
source: No Date
ar: لا يوجد تاريخ

# completedTasksSection
source: Completed
ar: المهام المكتملة

# noTasksIllustrationText
source: No tasks here! Time to add some study goals or daily reminders.
ar: لا توجد مهام هنا! حان الوقت لإضافة بعض أهداف الدراسة أو التذكيرات اليومية.

# noFilesIllustrationText
source: It looks like there are no files in this folder, or you haven't selected a subject yet.
ar: يبدو أنه لا توجد ملفات في هذا المجلد، أو لم تختر مادة بعد.

# emptySearchIllustrationText
source: No tasks found matching your search. Try a different keyword!
ar: لم يتم العثور على مهام مطابقة لبحثك. جرب كلمة مفتاحية مختلفة!

# todayTasksProgress
source: Today's Tasks: {completed} of {total} completed
ar: مهام اليوم: {completed} من {total} اكتملت

# notificationReminderBody
source: Reminder for:
ar: تذكير بـ:

# everyXDays
source: Every {count} days
ar: كل {count} أيام

source: Weekdays
ar: أيام الأسبوع

source: Weekends
ar: عطلات نهاية الأسبوع

# lecturesContentNotAvailable
source: Lectures content for {subjectName} is not yet available.
ar: محتوى المحاضرات لـ {subjectName} غير متاح بعد.

source: Download Selected
ar: تنزيل المحدد

source: View Details
ar: عرض التفاصيل

source: Enable Notifications
ar: تمكين الإشعارات

source: Home
ar: الرئيسية

source: Up-coming
ar: قريباً

# upComingContent
source: Up-coming content will be available soon!
ar: المحتوى القادم سيكون متاحاً قريباً!

# dashboardPlaceholder
source: Welcome to your Focus Zone Dashboard!
ar: مرحباً بك في لوحة التحكم الخاصة بك!

# dashboardComingSoon
source: Your activity, quick access, and personalized insights will appear here soon.
ar: سيظهر نشاطك والوصول السريع والإحصائيات المخصصة هنا قريباً.

# errorPageNotFound
source: Page not found: {pageName}
ar: الصفحة غير موجودة: {pageName}

# errorAttemptedGlobalPush
source: Attempted to open content outside the current tab's navigation. Please try again from the main tab, or report this issue if it persists.
ar: تمت محاولة فتح المحتوى خارج التنقل الحالي للعلامة التبويب. يرجى المحاولة مرة أخرى من علامة التبويب الرئيسية، أو الإبلاغ عن هذه المشكلة إذا استمرت.

# downloadFolderNotFound
source: Download folder not found. It might have been moved or deleted.
ar: مجلد التنزيلات غير موجود. ربما تم نقله أو حذفه.

source: GitHub Profile
ar: ملف GitHub الشخصي

source: Discord Profile
ar: ملف Discord الشخصي

source: Recent Files
ar: الملفات الأخيرة

# noRecentFiles
source: No recent files to display.
ar: لا توجد ملفات حديثة لعرضها.

source: Quick Settings
ar: الإعدادات السريعة

source: Quick Links
ar: روابط سريعة

# welcomeUser
source: Welcome, {userName}!
ar: أهلاً بك، {userName}!

source: Your Study Activity
ar: نشاطك الدراسي

source: Last Opened
ar: آخر فتح

# documentsViewedThisWeek
source: Documents viewed this week: {count}
ar: المستندات التي تمت مشاهدتها هذا الأسبوع: {count}

# keepLearning
source: Keep learning, consistency is key!
ar: استمر في التعلم، الاتساق هو المفتاح!

source: To-Do Snapshot
ar: نظرة عامة على المهام

source: Next Deadline
ar: الموعد النهائي القادم

# noUpcomingTasks
source: No upcoming tasks right now!
ar: لا توجد مهام قادمة حاليًا!

# dailyTaskProgress
source: Today's Progress: {completed} of {total} tasks completed
ar: تقدم اليوم: تم إكمال {completed} من {total} مهمة

# overdueTasksDashboard
source: Overdue Tasks: {count}
ar: المهام المتأخرة: {count}

source: Your Study Zone
ar: منطقة دراستك

source: Explore Subjects
ar: استكشاف المواد

# findNewMaterials
source: Find new materials and lectures.
ar: ابحث عن مواد ومحاضرات جديدة.

# createStudyGoal
source: Create a Study Goal
ar: إنشاء هدف دراسي

# planYourNextTask
source: Plan your next study task or reminder.
ar: خطط لمهمتك الدراسية أو تذكيرك التالي.

source: Choose New Location
ar: اختيار موقع جديد

source: Open Current Location
ar: فتح الموقع الحالي

source: Reset to Default
ar: إعادة تعيين إلى الافتراضي

# downloadLocationUpdated
source: Download location updated to: {path}
ar: تم تحديث موقع التنزيل إلى: {path}

# downloadLocationReset
source: Download location reset to default.
ar: تمت إعادة تعيين موقع التنزيل إلى الافتراضي.

source: No location selected.
ar: لم يتم اختيار موقع.

# failedToSetDownloadLocation
source: Failed to set download location: {error}
ar: فشل تعيين موقع التنزيل: {error}

# permissionDeniedForever
source: Storage permission denied permanently. Please grant it from app settings.
ar: تم رفض إذن التخزين بشكل دائم. يرجى منحه من إعدادات التطبيق.

# storagePermissionTitle
source: Storage Permission Required
ar: مطلوب إذن التخزين

# storagePermissionExplanation
source: This app needs storage permission to download and save files. Without this permission, you won't be able to download files or choose where to save them.
ar: يحتاج هذا التطبيق إلى إذن التخزين لتنزيل وحفظ الملفات. بدون هذا الإذن، لن تتمكن من تنزيل الملفات أو اختيار مكان حفظها.

# storagePermissionNote
source: This permission is required for downloading and managing your study materials. You can change this later in your device settings.
ar: هذا الإذن مطلوب لتنزيل وإدارة المواد الدراسية الخاصة بك. يمكنك تغيير هذا لاحقًا في إعدادات جهازك.

source: Continue
ar: متابعة

source: Zikr
ar: الأذكار

source: Azkar
ar: أذكار

source: Quran
ar: قرآن

source: Prayer Times
ar: أوقات الصلاة

source: Morning Remembrance
ar: أذكار الصباح

source: Evening Remembrance
ar: أذكار المساء

source: Custom Zikr
ar: سبحة خاصة

source: Zikr Counter
ar: عداد الأذكار

# tapToCount
source: Tap anywhere to count
ar: انقر في أي مكان للعد

# azkarTime
source: {count,plural, =1{{count} time} =2{{count} times} other{{count} times}}
ar: {count,plural, =1{{count} مرة} =2{{count} مرتان} other{{count} مرات}}

# azkarCompleted
source: MashaAllah, you have completed the Azkar!
ar: ما شاء الله، لقد أتممت الأذكار!

source: No surahs found.
ar: لم يتم العثور على سور.

# failedToLoadSurahs
source: Failed to load surahs. Please check your connection.
ar: فشل تحميل السور. يرجى التحقق من اتصالك.

# failedToLoadAyahs
source: Failed to load ayahs. Please check your connection.
ar: فشل تحميل الآيات. يرجى التحقق من اتصالك.

source: Failed to load prayer times.
ar: فشل في تحميل أوقات الصلاة.

# untilNextPrayer
source: Until {prayerName} prayer
ar: حتى صلاة {prayerName}

# prayerNameFajr
source: Fajr
ar: الفجر

# prayerNameSunrise
source: Sunrise
ar: الشروق

# prayerNameDhuhr
source: Dhuhr
ar: الظهر

# prayerNameAsr
source: Asr
ar: العصر

# prayerNameMaghrib
source: Maghrib
ar: المغرب

# prayerNameIsha
source: Isha
ar: العشاء

# prayerNameJumah
source: Jumah
ar: جمعة

# sortByDueDateAsc
source: Due Date (Asc)
ar: تاريخ الاستحقاق (تصاعدي)

# sortByDueDateDesc
source: Due Date (Desc)
ar: تاريخ الاستحقاق (تنازلي)

# sortByTitleAsc
source: Title (Asc)
ar: العنوان (تصاعدي)

# sortByTitleDesc
source: Title (Desc)
ar: العنوان (تنازلي)

source: All Tasks
ar: كل المهام

# activeTasks
source: Active
ar: نشطة

# completedTasks
source: Completed
ar: مكتملة

source: Edit
ar: تعديل

source: Done
ar: تم

source: Undo
ar: تراجع

source: Task options
ar: خيارات المهمة

source: Edit task
ar: تعديل المهمة

source: Mark as not done
ar: وضع كغير مكتملة

source: Mark as done
ar: وضع كمكتملة

source: Delete Task
ar: حذف المهمة

# deleteTaskConfirmation
source: Are you sure you want to delete this task?
ar: هل أنت متأكد أنك تريد حذف هذه المهمة؟

# repeats
source: Repeats: {repeatInterval}
ar: تكرار: {repeatInterval}

source: Completed
ar: مكتمل

source: Due Today
ar: مستحق اليوم

source: Less than one day
ar: أقل من يوم

# dueIn
source: Due in {timeString}
ar: مستحق خلال {timeString}

# overdueBy
source: Overdue by {timeString}
ar: متأخر منذ {timeString}

# year
source: {count, plural, one{year} other{years}}
ar: {count, plural, one{سنة} other{سنوات}}

# month
source: {count, plural, one{month} other{months}}
ar: {count, plural, one{شهر} other{شهور}}

# week
source: {count, plural, one{week} other{weeks}}
ar: {count, plural, one{أسبوع} other{أسابيع}}

# day
source: {count, plural, one{day} other{days}}
ar: {count, plural, one{يوم} other{أيام}}

source: Write your Zikr
ar: اكتب الذكر الخاص بك

# zikrHint
source: E.g., SubhanAllah, Alhamdulillah...
ar: مثال: سبحان الله، الحمد لله...

# errorZikrEmpty
source: Please enter the Zikr text.
ar: الرجاء إدخال نص الذكر.

# setRepetitions
source: Set the number of repetitions
ar: حدد عدد التكرارات

# errorCountEmpty
source: Please enter a count.
ar: الرجاء إدخال عدد.

# errorCountZero
source: Count must be greater than zero.
ar: يجب أن يكون العدد أكبر من صفر.

source: Start
ar: ابدأ

# myAzkarTitle
source: My Azkar
ar: أذكاري

# addZikrTitle
source: Add Zikr
ar: إضافة ذكر

# editZikrTitle
source: Edit Zikr
ar: تعديل الذكر

# streakLabel
source: Streak: {streakCount}
ar: متتالية: {streakCount}

# deleteConfirmationTitle
source: Delete Zikr
ar: حذف الذكر

# deleteConfirmationContent
source: Are you sure you want to permanently delete this Zikr?
ar: هل أنت متأكد من رغبتك في حذف هذا الذكر نهائياً؟

source: Delete
ar: حذف

source: Save
ar: حفظ

# quickAddTitle
source: Quick Add Suggestions
ar: إضافات سريعة مقترحة

# emptyAzkarList
source: Your custom Azkar list is empty. Tap the + button to add a new one.
ar: قائمة أذكارك فارغة. اضغط على زر + لإضافة ذكر جديد.

# suggestion1
source: Glory is to Allah
ar: سبحان الله

# suggestion2
source: Praise be to Allah
ar: الحمد لله

# suggestion3
source: Allah is the Greatest
ar: الله أكبر

# suggestion4
source: I seek the forgiveness of Allah
ar: أستغفر الله

# dailyCountLabel
source: Completed today: {count}
ar: مرات الإنجاز اليوم: {count}

# quickCounterTitle
source: Quick Counter
ar: عداد سريع

source: Reset
ar: إعادة ضبط

# quranTitle
source: Quran
ar: القرآن الكريم

# quranSubtitle
source: The Holy Quran
ar: القرآن الكريم

# quranDescription
source: Read, download, and manage the full Quran and Juzs.
ar: اقرأ، نزّل، وادِر القرآن الكريم والأجزاء.

source: Browse Juzs
ar: تصفح الأجزاء

# browseJuzsSubtitle
source: View and download individual Juzs
ar: عرض وتنزيل الأجزاء الفردية

source: View Full Quran
ar: عرض القرآن الكامل

source: Pause Download
ar: إيقاف التنزيل مؤقتًا

source: Resume Download
ar: استئناف التنزيل

source: Download Full Quran
ar: تنزيل القرآن الكامل

# fullQuranReady
source: Full Quran is ready to view!
ar: القرآن الكامل جاهز للعرض!

# pagesCount
source: {downloaded}/{total} pages ({progress}%)
ar: {downloaded}/{total} صفحة ({progress}%)

source: Loading...
ar: جارٍ التحميل...

# completeQuran
source: Complete Quran ({size}, {pages} pages)
ar: القرآن الكامل ({size}، {pages} صفحة)

source: Pausing, please wait...
ar: يتم الإيقاف المؤقت، يرجى الانتظار...

source: Cancelling, please wait...
ar: يتم الإلغاء، يرجى الانتظار...

source: Deleting, please wait...
ar: يتم الحذف، يرجى الانتظار...

source: Delete Full Quran
ar: حذف القرآن الكامل

# freeUpStorage
source: Free up storage space
ar: توفير مساحة تخزين

source: Download incomplete
ar: التنزيل غير مكتمل

# pagesDownloaded
source: {downloaded} of {total} pages downloaded
ar: تم تنزيل {downloaded} من {total} صفحة

# anErrorOccurred
source: An error occurred during download.
ar: حدث خطأ أثناء التنزيل.

# stillUnderDevelopment
source: This feature is still under development.
ar: هذه الميزة قيد التطوير.

# downloadFullQuranDialog
source: The full Quran is approximately {size} and contains {pages} pages. This may take some time to download. Continue? KEEP INTERNET CONNECTION ON
ar: حجم القرآن الكامل تقريبًا {size} ويحتوي على {pages} صفحة. قد يستغرق التنزيل بعض الوقت. هل تريد المتابعة؟

# areYouSureDeleteQuran
source: Are you sure you want to delete the full Quran? This will free up storage space but you will need to download it again to view it.
ar: هل أنت متأكد أنك تريد حذف القرآن الكامل؟ سيؤدي ذلك إلى توفير مساحة تخزين ولكن ستحتاج إلى تنزيله مرة أخرى للعرض.

# fullQuranDeleted
source: Full Quran deleted successfully.
ar: تم حذف القرآن الكامل بنجاح.

source: Download Controls
ar: إدارة التنزيل

source: Progress
ar: التقدم

# current
source: Current file:
ar: الملف الحالي:

source: Pause
ar: إيقاف مؤقت

source: Delete Downloaded Files
ar: حذف الملفات التي تم تنزيلها

# juzListTitle
source: Juz List
ar: قائمة الأجزاء

# selectedCount
source: {count} selected
ar: {count} محدد

source: Delete Selected
ar: حذف المحدد

# juzNotDownloaded
source: Juz {juz} is not downloaded.
ar: الجزء {juz} غير مُنزّل.

source: Juz Properties
ar: خصائص الجزء

source: File count
ar: عدد الملفات

source: Total size
ar: الحجم الكلي

source: Close
ar: إغلاق

source: Could not load properties.
ar: تعذر تحميل الخصائص.

# pendingPausing
source: Pausing...
ar: يتم الإيقاف المؤقت...

# pendingCancelling
source: Cancelling...
ar: يتم الإلغاء...

# pendingDeleting
source: Deleting...
ar: يتم الحذف...

# pagesLabel
source: pages
ar: صفحات

# surahListTitle
source: Surah List
ar: قائمة السور

# surahLoadError
source: Error loading Surahs
ar: خطأ في تحميل السور

# noSurahData
source: No Surah data available.
ar: لا توجد بيانات سور متاحة.

# ayahCountLabel
source: Ayahs
ar: آيات

# makkiType
source: Makki
ar: مكية

# madaniType
source: Madani
ar: مدنية
