Repository: waytoo-average/Focus-zone
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Reading Settings
ar: إعدادات القراءة

source: Night Mode
ar: الوضع الليلي

# nightModeSubtitle
source: Dark background for low light
ar: خلفية داكنة للإضاءة المنخفضة

source: Scroll Direction
ar: اتجاه التمرير

source: Horizontal
ar: أفقي

source: Vertical
ar: عمودي

source: Reading Timer
ar: مؤقت القراءة

# timerRunning
source: Running: {time}
ar: يعمل: {time}

# timerNotRunning
source: Not running
ar: غير نشط

source: Auto Scroll
ar: التمرير التلقائي

# autoScrollEnabled
source: Enabled ({seconds}s/page)
ar: مفعل ({seconds}ث/صفحة)

# autoScrollDisabled
source: Disabled
ar: معطل

source: Scroll Speed
ar: سرعة التمرير

# secondsPerPage
source: {seconds} seconds per page
ar: {seconds} ثانية لكل صفحة

# minTimeToCountPage
source: Minimum Time to Count Page as Read
ar: الحد الأدنى لاحتساب الصفحة كمقروءة

# secondsLabel
source: {seconds} seconds
ar: {seconds} ثانية

source: Reading Analytics
ar: تحليلات القراءة

source: Streaks
ar: سلاسل القراءة

source: Day Streak
ar: سلسلة الأيام

source: Today
ar: اليوم

source: Goals
ar: الأهداف

source: Daily Goal
ar: الهدف اليومي

# minutesGoalProgress
source: {minutes} / {goal} minutes
ar: {minutes} / {goal} دقيقة

source: Weekly Goal
ar: الهدف الأسبوعي

# pagesGoalProgress
source: {pages} / {goal} pages
ar: {pages} / {goal} صفحة

# noInsights
source: No insights yet. Start reading to see tips!
ar: لا توجد نصائح بعد. ابدأ القراءة لرؤية النصائح!

# noReadingSessions
source: No reading sessions yet.
ar: لا توجد جلسات قراءة بعد.

# startStreakTip
source: Start a streak by reading every day!
ar: ابدأ سلسلة بقراءة كل يوم!

# totalTimeReading
source: Total time reading: {seconds} seconds
ar: إجمالي وقت القراءة: {seconds} ثانية

source: Insights
ar: نصائح

source: Session Insights
ar: إحصاءات الجلسة

source: History
ar: السجل

source: Pages Read (Last 7 Days)
ar: الصفحات المقروءة (آخر 7 أيام)

source: Recent Sessions
ar: الجلسات الأخيرة

source: Set Daily Goal
ar: تحديد الهدف اليومي

source: View Downloaded Juzs
ar: عرض الأجزاء المُنزّلة

source: Switch Juz
ar: تبديل الجزء

# downloadedJuzsTitle
source: Downloaded Juzs
ar: الأجزاء المُنزّلة

# juzsDownloaded
source: {downloaded}/{total} Juzs downloaded
ar: {downloaded}/{total} جزء مُنزّل

# noSessionData
source: No session data yet. Start a session to see insights.
ar: لا توجد بيانات جلسة بعد. ابدأ جلسة لرؤية الإحصاءات.
